////////////////////////////////////////////////////////////////////////////
//                ¸øÁ¦Õßµ¥Æ¬»ú¿ª·¢Ñ§Ï°ÏµÍ³£¬¿ª·¢Ñ§Ï°¶¼¸øÁ¦£¡              //
////////////////////////////////////////////////////////////////////////////
//                     Ñ§Ï°51µ¥Æ¬»ú£¬ÆäÊµ¿ÉÒÔºÜ¼òµ¥                       //
////////////////////////////////////////////////////////////////////////////
//                Äþ²¨Ð¾¶¯µç×ÓÓÐÏÞ¹«Ë¾  www.MovingChip.com                //
////////////////////////////////////////////////////////////////////////////

#include <AT89X52.h>       //µ÷ÓÃ51µ¥Æ¬»úµÄÍ·ÎÄ¼þ
#include <Intrins.h>       //Òò±¾ÀýÐèÒªÊ¹ÓÃ¿Õ²Ù×÷£¬±ØÐëµ÷ÓÃÕâ¸öÍ·ÎÄ¼þ

//---------------------------------------
//1602Òº¾§Ïà¹ØI/OÉèÖÃ
sbit E=P2^3;               //1602Òº¾§µÄE½Å½ÓÔÚP2.3¿ÚÉÏ
sbit RW=P2^4;              //1602Òº¾§µÄRW½Å½ÓÔÚP2.4¿ÚÉÏ
sbit RS=P2^5;              //1602Òº¾§µÄRS½Å½ÓÔÚP2.5¿ÚÉÏ
//---------------------------------------

//---------------------------------------
//Èí¼þÄ£ÄâIICÏà¹ØI/OÉèÖÃ
sbit SCL=P1^1;             //PCF8563TµÄ SCL Òý½Å½ÓÓÚµ¥Æ¬»úµÄP1^1Òý½ÅÉÏ
sbit SDA=P1^0;             //PCF8563TµÄ SDA Òý½Å½ÓÓÚµ¥Æ¬»úµÄP1^0Òý½ÅÉÏ
//---------------------------------------


unsigned char j;      
//---------------------------------------

//---------------------------------------
//1602Òº¾§¼Ä´æÆ÷ÉèÖÃ
unsigned char DISbuf;     //ÉèÖÃ8Î»µÄunsigend charÐÍ¼Ä´æÆ÷ÓÃÀ´ÔÝ´æ1602ÒªÏÔÊ¾µÄÄÚÈÝ
//---------------------------------------

//---------------------------------------
//Ãû³Æ£ºÉúIICÆô¶¯ÐÅºÅº¯Êý
//ÊÊÓÃ£º¸øÁ¦ÕßGL9µ¥Æ¬»ú¿ª·¢Ñ§Ï°ÏµÍ³
//¹«Ë¾£ºÄþ²¨Ð¾¶¯µç×ÓÓÐÏÞ¹«Ë¾
//ÍøÖ·£ºwww.MovingChip.com
//ÈÕÆÚ£º20140215
//---------------------------------------
void IICstart(void)
{ 
     SDA=1;                //ÏÈ½«SDA=1£¬ÒÔ×¼±¸ÔÚSCL=1Ê±£¬½«SDA=0
     SCL=1;                //Ê±ÖÓ×ÜÏßÀ­¸ß 
     _nop_();          		//ÂÔ×öÑÓÊ±
     _nop_();          		//ÂÔ×öÑÓÊ±
     SDA=0;                //SCL=1Ê±£¬½«SDAÀ­µÍ¼´²úÉúÆô¶¯ÐÅºÅ 
     _nop_();          		//ÂÔ×öÑÓÊ±
     _nop_();          		//ÂÔ×öÑÓÊ±
     SCL=0;                //½«SCL=0£¬Íê³ÉÆô¶¯ÐÅºÅ²Ù×÷      
} 

//---------------------------------------
//Ãû³Æ£ºIICÍ£Ö¹ÐÅºÅº¯Êý
//ÊÊÓÃ£º¸øÁ¦ÕßGL9µ¥Æ¬»ú¿ª·¢Ñ§Ï°ÏµÍ³
//¹«Ë¾£ºÄþ²¨Ð¾¶¯µç×ÓÓÐÏÞ¹«Ë¾
//ÍøÖ·£ºwww.MovingChip.com
//ÈÕÆÚ£º20140215
//---------------------------------------
void IICstop(void)
{ 
     SDA=0;                //ÏÈ½«SDA=0£¬ÒÔ×¼±¸ÔÚSCL=1Ê±£¬½«SDA=1
     SCL=1;                //Ê±ÖÓ×ÜÏßÀ­¸ß 
     _nop_();          		//ÂÔ×öÑÓÊ±
     _nop_();          		//ÂÔ×öÑÓÊ± 
     SDA=1;                //SCL=1Ê±£¬½«SDAÀ­¸ß¼´²úÉúÍ£Ö¹ÐÅºÅ 
     _nop_();          		//ÂÔ×öÑÓÊ±
     _nop_();          		//ÂÔ×öÑÓÊ±
     SCL=0;                //½«SCL=0£¬Íê³ÉÆô¶¯ÐÅºÅ²Ù×÷      
} 

//---------------------------------------
//Ãû³Æ£ºÏòIIC×ÜÏßÐ´Èë1¸ö×Ö½Úº¯Êý
//ÊÊÓÃ£º¸øÁ¦ÕßGL9µ¥Æ¬»ú¿ª·¢Ñ§Ï°ÏµÍ³
//¹«Ë¾£ºÄþ²¨Ð¾¶¯µç×ÓÓÐÏÞ¹«Ë¾
//ÍøÖ·£ºwww.MovingChip.com
//ÈÕÆÚ£º20140215
//---------------------------------------
void Write1Byte(unsigned char Buf1)
{ 
     unsigned char k;      //1¸ö×Ö½ÚÒª·Ö8´ÎÐ´Èë£¬ÐèÒª¶¨ÒåÒ»¸ö¼Ä´æÆ÷ÓÃÀ´¼ÆÊý
     for(k=0;k<8;k++)      //×öÒ»¸ö8´ÎµÄÑ­»·£¬Ã¿´ÎÐ´Èë1Î»£¬ÐèÒªÐ´8´Î
     {
         if(Buf1&0x80)     //´Ó×î¸ßÎ»¿ªÊ¼Ð´ 
         {
             SDA=1;        //Èç¹ûÓûÐ´ÈëÊý¾ÝÎª1£¬¾Í½«Êý¾ÝÏßÖÃ1
         }
         else
         {
             SDA=0;        //Èç¹ûÓûÐ´ÈëÊý¾ÝÎª0£¬¾Í½«Êý¾ÝÏßÐ´0 
         }
         _nop_();          //ÂÔ×öÑÓÊ±
         _nop_();          //ÂÔ×öÑÓÊ±
         SCL=1;            //Ê±ÖÓÏß×öÒ»¸öÉÏÉýÑØ£¬½«Ò»Î»Êý¾ÝÐ´Èë
         Buf1=Buf1<<1;     //Êý¾Ý×óÒÆÒ»Î»£¬½«ÏÂ´ÎÒªÐ´ÈëµÄÎ»Êý¾ÝÒÆµ½×î¸ßÎ»
         _nop_();          //ÂÔ×öÑÓÊ±
         SCL=0;            //½«SCL=0£¬ÒÔ×¼±¸Í¨¹ýÉÏÉýÑØ½«Êý¾ÝÐ´Èë
         _nop_();          //ÂÔ×öÑÓÊ±
     }
     SDA=1;                //½«SDA=1£¬×¼±¸¶ÁÓ¦´ðÐÅºÅ
     _nop_();              //ÂÔ×öÑÓÊ±
     SCL=1;                //½«SCL=1£¬×ö¸öÉÏÉýÑØ×¼±¸¶ÁÓ¦´ðÐÅºÅ
     _nop_();              //ÂÔ×öÑÓÊ±
     _nop_();              //ÂÔ×öÑÓÊ±
     SCL=0;                //½«SCL=0£¬½áÊøÓ¦´ðÐÅºÅ¶Á²Ù×÷
} 

//---------------------------------------
//Ãû³Æ£º´ÓIIC×ÜÏß¶ÁÈë1¸ö×Ö½Úº¯Êý
//ÊÊÓÃ£º¸øÁ¦ÕßGL9µ¥Æ¬»ú¿ª·¢Ñ§Ï°ÏµÍ³
//¹«Ë¾£ºÄþ²¨Ð¾¶¯µç×ÓÓÐÏÞ¹«Ë¾
//ÍøÖ·£ºwww.MovingChip.com
//ÈÕÆÚ£º20140215
//---------------------------------------
unsigned char Read1Byte(void)
{ 
     unsigned char k;      //1¸ö×Ö½ÚÒª·Ö8´Î¶Á³ö£¬ÐèÒª¶¨ÒåÒ»¸ö¼Ä´æÆ÷ÓÃÀ´¼ÆÊý
     unsigned char t=0;    //¶¨ÒåÒ»¸ö¼Ä´æÆ÷ÓÃ±£´æ¶Á³öÊý¾Ý
     for(k=0;k<8;k++)      //×öÒ»¸ö8´ÎµÄÑ­»·£¬Ã¿´Î¶ÁÈë1Î»£¬ÐèÒª¶Á8´Î
     {
         t=t<<1;           //Êý¾Ý×óÒÆÒ»Î»£¬¿Õ³ö×îµÍÎ»ÒÔ×¼±¸±£´æ¶ÁÈëµÄÒ»Î»Êý¾Ý
         SDA=1;            //½«SDAÐ´1×¼±¸¶Á
         SCL=1;            //½«SCL=1£¬×ö¸öÉÏÉýÑØ×¼±¸¶ÁÒ»Î»Êý¾Ý
         _nop_();          //ÂÔ×öÑÓÊ±
         _nop_();          //ÂÔ×öÑÓÊ±
         if(SDA==1)        //¶ÁÒ»Î»Êý¾Ý£¬²¢ÅÐ¶Ï 
         {
             t=t|0x01;     //Èç¹û¶ÁÈëÊý¾ÝÎª1£¬¾Í½«½ÓÊÕ»º³åÇø×îµÍÒ»Î»ÖÃ1
         }
         else
         {
             t=t&0xfe;     //Èç¹û¶ÁÈëÊý¾ÝÎª0£¬¾Í½«½ÓÊÕ»º³åÇø×îµÍÒ»Î»Ð´0
         }
         SCL=0;            //SCL»Ö¸´Îª0£¬½áÊøÒ»Î»Êý¾Ý¶Á²Ù×÷
         _nop_();          //ÂÔ×öÑÓÊ±
         _nop_();          //ÂÔ×öÑÓÊ±
     }
     return t;             //½«¶ÁÈëµÄÒ»¸ö×Ö½Ú·µ»Ø
} 

//---------------------------------------
//Ãû³Æ£ºÈí¼þÄ£ÄâIICÏòPCF8563Ö¸¶¨µØÖ·Ð´Ò»¸ö×Ö½Úº¯Êý
//ÊÊÓÃ£º¸øÁ¦ÕßGL9µ¥Æ¬»ú¿ª·¢Ñ§Ï°ÏµÍ³
//¹«Ë¾£ºÄþ²¨Ð¾¶¯µç×ÓÓÐÏÞ¹«Ë¾
//ÍøÖ·£ºwww.MovingChip.com
//ÈÕÆÚ£º20140215
//---------------------------------------
void WritePCF8563(unsigned char Address,unsigned char Databuf)
{                          //Ö±½Óµ÷ÓÃ±¾º¯Êý¼´¿É¶ÔPCF8563µÄAddressµØÖ·Ð´Databuf
    IICstart();            //IICÆô¶¯ÐÅºÅ

    Write1Byte(0xA2);      //·¢ËÍPCF8563µÄÆ÷¼þµØÖ·ºÍÐ´ÐÅºÅ

    Write1Byte(Address);   //·¢ËÍµØÖ·

    Write1Byte(Databuf);   //·¢ËÍÊý¾Ý

    IICstop();             //²úÉúIICÍ£Ö¹ÐÅºÅ
}

//---------------------------------------
//Ãû³Æ£ºÈí¼þÄ£ÄâIIC´ÓPCF8563Ö¸¶¨µØÖ·¶ÁÒ»¸ö×Ö½Úº¯Êý
//ÊÊÓÃ£º¸øÁ¦ÕßGL9µ¥Æ¬»ú¿ª·¢Ñ§Ï°ÏµÍ³
//¹«Ë¾£ºÄþ²¨Ð¾¶¯µç×ÓÓÐÏÞ¹«Ë¾
//ÍøÖ·£ºwww.MovingChip.com
//ÈÕÆÚ£º20140215
//---------------------------------------
unsigned ReadPCF8563(unsigned char Address)
{                          //Ö±½Óµ÷ÓÃ±¾º¯Êý¼´¿É´ÓPCF8563µÄAddressµØÖ·¶Á³öÊý¾Ý·µ»Ø
    unsigned char buf;     //¶¨ÒåÒ»¸ö¼Ä´æÆ÷ÓÃÀ´ÔÝ´æ¶Á³öµÄÊý¾Ý
    IICstart();            //IICÆô¶¯ÐÅºÅ

    Write1Byte(0xA2);      //·¢ËÍPCF8563µÄÆ÷¼þµØÖ·ºÍÐ´ÐÅºÅ

    Write1Byte(Address);   //·¢ËÍµØÖ·

    IICstart();            //IICÆô¶¯ÐÅºÅ

    Write1Byte(0xA3);      //·¢ËÍPCF8563µÄÆ÷¼þµØÖ·ºÍ¶ÁÐÅºÅ

    buf=Read1Byte();//¶ÁÒ»¸ö×Ö½ÚÊý¾Ý

    IICstop();             //²úÉúIICÍ£Ö¹ÐÅºÅ

    return(buf);           //½«¶Á³öÊý¾Ý·µ»Ø
}

//---------------------------------------
//Ãû³Æ£º1602Òº¾§ÓÃÑÓÊ±º¯Êý
//ÊÊÓÃ£º¸øÁ¦ÕßGL9µ¥Æ¬»ú¿ª·¢Ñ§Ï°ÏµÍ³
//¹«Ë¾£ºÄþ²¨Ð¾¶¯µç×ÓÓÐÏÞ¹«Ë¾
//ÍøÖ·£ºwww.MovingChip.com
//ÈÕÆÚ£º20140215
//---------------------------------------
void Delay1602(unsigned int t)
{ 
     unsigned int k;      //¶¨ÒåÒ»¸ö16Î»¼Ä´æÆ÷ÓÃÀ´×öÑÓÊ±ÓÃ 
     for(k=0;k<t;k++);    //ÑÓÊ± 
} 

//---------------------------------------
//Ãû³Æ£º1602Òº¾§Ã¦¼ì²âº¯Êý
//ÊÊÓÃ£º¸øÁ¦ÕßGL9µ¥Æ¬»ú¿ª·¢Ñ§Ï°ÏµÍ³
//¹«Ë¾£ºÄþ²¨Ð¾¶¯µç×ÓÓÐÏÞ¹«Ë¾
//ÍøÖ·£ºwww.MovingChip.com
//ÈÕÆÚ£º20140215
//---------------------------------------
void LCD1602_busy(void)
{ 
     P0_7=1;              //½«P0.7ÖÃ1£¬Îª¶Á×´Ì¬×ö×¼±¸ 
     RS=0;                //RS=0¡¢RW=1¡¢E=1Ê±£¬Ã¦ÐÅºÅÊä³öµ½DB7£¬ÓÉP0.7¶ÁÈë
     RW=1;                //RS=0¡¢RW=1¡¢E=1Ê±£¬Ã¦ÐÅºÅÊä³öµ½DB7£¬ÓÉP0.7¶ÁÈë
     E=1;                 //RS=0¡¢RW=1¡¢E=1Ê±£¬Ã¦ÐÅºÅÊä³öµ½DB7£¬ÓÉP0.7¶ÁÈë
     while(P0_7==1);      //ÓÉP0.7¶ÁÈë1£¬±íÊ¾1602Òº¾§Ã¦£¬ÐèÒªµÈ´ý
     E=0;                 //¶ÁÍêÒÔºó£¬»Ö¸´EµÄµçÆ½
} 

//---------------------------------------
//Ãû³Æ£º1600Ð´ÃüÁîº¯Êý
//ÊÊÓÃ£º¸øÁ¦ÕßGL9µ¥Æ¬»ú¿ª·¢Ñ§Ï°ÏµÍ³
//¹«Ë¾£ºÄþ²¨Ð¾¶¯µç×ÓÓÐÏÞ¹«Ë¾
//ÍøÖ·£ºwww.MovingChip.com
//ÈÕÆÚ£º20140215
//---------------------------------------
void LCD1602_Write_com(unsigned char combuf)
{ 
     RS=0;                //Ñ¡ÔñÖ¸Áî¼Ä´æÆ÷
     RW=0;                //Ñ¡ÔñÐ´×´Ì¬
     P0=combuf;           //½«ÃüÁî×ÖÍ¨¹ýP0¿ÚËÍÖÁDB
     E=1;                 //E¸ßµçÆ½½«ÃüÁî×ÖÐ´Èë1602Òº¾§
     E=0;                 //Ð´ÍêÒÔºó£¬»Ö¸´EµÄµçÆ½
} 

//---------------------------------------
//Ãû³Æ£º1602Ð´ÃüÁîº¯Êý(´øÃ¦¼ì²â)
//ÊÊÓÃ£º¸øÁ¦ÕßGL9µ¥Æ¬»ú¿ª·¢Ñ§Ï°ÏµÍ³
//¹«Ë¾£ºÄþ²¨Ð¾¶¯µç×ÓÓÐÏÞ¹«Ë¾
//ÍøÖ·£ºwww.MovingChip.com
//ÈÕÆÚ£º20140215
//---------------------------------------
void LCD1602_Write_com_busy(unsigned char combuf)
{ 
     LCD1602_busy();            //µ÷ÓÃÃ¦¼ì²âº¯Êý
     LCD1602_Write_com(combuf); //µ÷ÓÃÃ¦¼ì²âº¯Êý
} 

//---------------------------------------
//Ãû³Æ£º1602Ð´Êý¾Ýº¯Êý(´øÃ¦¼ì²â)
//ÊÊÓÃ£º¸øÁ¦ÕßGL9µ¥Æ¬»ú¿ª·¢Ñ§Ï°ÏµÍ³
//¹«Ë¾£ºÄþ²¨Ð¾¶¯µç×ÓÓÐÏÞ¹«Ë¾
//ÍøÖ·£ºwww.MovingChip.com
//ÈÕÆÚ£º20140215
//---------------------------------------
void LCD1602_Write_data_busy(unsigned char databuf)
{ 
     LCD1602_busy();      //µ÷ÓÃÃ¦¼ì²âº¯Êý
     RS=1;                //Ñ¡ÔñÊý¾Ý¼Ä´æÆ÷
     RW=0;                //Ñ¡ÔñÐ´×´Ì¬
     P0=databuf;          //½«ÃüÁî×ÖÍ¨¹ýP0¿ÚËÍÖÁDB
     E=1;                 //E¸ßµçÆ½½«ÃüÁî×ÖÐ´Èë1602Òº¾§
     E=0;                 //Ð´ÍêÒÔºó£¬»Ö¸´EµÄµçÆ½
} 

//---------------------------------------
//Ãû³Æ£º1602Òº¾§ÏÔÊ¾µØÖ·Ð´º¯Êý
//ÊÊÓÃ£º¸øÁ¦ÕßGL9µ¥Æ¬»ú¿ª·¢Ñ§Ï°ÏµÍ³
//¹«Ë¾£ºÄþ²¨Ð¾¶¯µç×ÓÓÐÏÞ¹«Ë¾
//ÍøÖ·£ºwww.MovingChip.com
//ÈÕÆÚ£º20140215
//---------------------------------------
void LCD1602_Write_address(unsigned char x,unsigned char y)
{ 
     x&=0x0f;             //ÁÐµØÖ·ÏÞÖÆÔÚ0-15¼ä
     y&=0x01;             //ÐÐµØÖ·ÏÞÖÆÔÚ0-1¼ä
     if(y==0)             //Èç¹ûÊÇµÚÒ»ÐÐ
         LCD1602_Write_com_busy(x|0x80);        //½«ÁÐµØÖ·Ð´Èë
     else                 //Èç¹ûÊÇµÚ¶þÐÐ
         LCD1602_Write_com_busy((x+0x40)|0x80); //½«ÁÐµØÖ·Ð´Èë
} 

//---------------------------------------
//Ãû³Æ£º1602Òº¾§³õÊ¼»¯º¯Êý
//ÊÊÓÃ£º¸øÁ¦ÕßGL9µ¥Æ¬»ú¿ª·¢Ñ§Ï°ÏµÍ³
//¹«Ë¾£ºÄþ²¨Ð¾¶¯µç×ÓÓÐÏÞ¹«Ë¾
//ÍøÖ·£ºwww.MovingChip.com
//ÈÕÆÚ£º20140215
//---------------------------------------
void LCD1602_init(void)
{ 
     Delay1602(1500);               //µ÷ÓÃÑÓÊ±º¯Êý
     LCD1602_Write_com(0x38);       //8Î»Êý¾Ý×ÜÏß£¬Á½ÐÐÏÔÊ¾Ä£Ê½£¬5*7µãÕóÏÔÊ¾
     Delay1602(500);                //µ÷ÓÃÑÓÊ±º¯Êý
     LCD1602_Write_com(0x38);       //8Î»Êý¾Ý×ÜÏß£¬Á½ÐÐÏÔÊ¾Ä£Ê½£¬5*7µãÕóÏÔÊ¾
     Delay1602(500);                //µ÷ÓÃÑÓÊ±º¯Êý
     LCD1602_Write_com(0x38);       //8Î»Êý¾Ý×ÜÏß£¬Á½ÐÐÏÔÊ¾Ä£Ê½£¬5*7µãÕóÏÔÊ¾
     LCD1602_Write_com_busy(0x38);  //8Î»Êý¾Ý×ÜÏß£¬Á½ÐÐÏÔÊ¾Ä£Ê½£¬5*7µãÕóÏÔÊ¾
     LCD1602_Write_com_busy(0x08);  //ÏÔÊ¾¹¦ÄÜ¹Ø£¬ÎÞ¹â±ê
     LCD1602_Write_com_busy(0x01);  //ÇåÆÁ
     LCD1602_Write_com_busy(0x06);  //Ð´ÈëÐÂµÄÊý¾Ýºó£¬¹â±êÓÒÒÆ£¬ÏÔÊ¾ÆÁ²»ÒÆ¶¯
     LCD1602_Write_com_busy(0x0C);  //ÏÔÊ¾¹¦ÄÜ¿ª£¬ÎÞ¹â±ê
} 

//---------------------------------------
//Ãû³Æ£º1602Òº¾§Ö¸¶¨µØÖ·ÏÔÊ¾º¯Êý
//ÊÊÓÃ£º¸øÁ¦ÕßGL9µ¥Æ¬»ú¿ª·¢Ñ§Ï°ÏµÍ³
//¹«Ë¾£ºÄþ²¨Ð¾¶¯µç×ÓÓÐÏÞ¹«Ë¾
//ÍøÖ·£ºwww.MovingChip.com
//ÈÕÆÚ£º20140215
//---------------------------------------
void LCD1602_Disp(unsigned char x,unsigned char y,unsigned char buf)
{ 
     LCD1602_Write_address(x,y);    //ÏÈ½«µØÖ·ÐÅÏ¢Ð´Èë
     LCD1602_Write_data_busy(buf);  //ÔÙÐ´ÈëÒªÏÔÊ¾µÄÊý¾Ý
} 

//---------------------------------------
//Ãû³Æ: Ö÷º¯Êý
//ÊÊÓÃ£º¸øÁ¦ÕßGL9µ¥Æ¬»ú¿ª·¢Ñ§Ï°ÏµÍ³
//¹«Ë¾£ºÄþ²¨Ð¾¶¯µç×ÓÓÐÏÞ¹«Ë¾
//ÍøÖ·£ºwww.MovingChip.com
//ÈÕÆÚ£º20140215
//---------------------------------------
void main(void)            //Ö÷º¯Êý,µ¥Æ¬»ú¿ª»úºó¾ÍÊÇ´ÓÕâ¸öº¯Êý¿ªÊ¼ÔËÐÐ
{

    LCD1602_init();        //µ÷ÓÃ1602Òº¾§³õÊ¼»¯º¯Êý

    //***³õÊ¼»¯Ê±ÖÓÐ¾Æ¬µÄ²ÎÊýÎª12Äê9ÔÂ3ÈÕ20µã03·Ö07Ãë***
    WritePCF8563(0x00,0x00); //Æô¶¯PCF8563
    WritePCF8563(0x02,0x07); //ÉèÖÃÃë³õÊ¼²ÎÊýÎª07
    WritePCF8563(0x03,0x03); //ÉèÖÃ·ÖÖÓ³õÊ¼²ÎÊýÎª03
    WritePCF8563(0x04,0x20); //ÉèÖÃÐ¡Ê±³õÊ¼²ÎÊýÎª20
    WritePCF8563(0x05,0x03); //ÉèÖÃÈÕ³õÊ¼²ÎÊýÎª03
    WritePCF8563(0x06,0x01); //ÉèÖÃÐÇÆÚ³õÊ¼²ÎÊýÎª01
    WritePCF8563(0x07,0x09); //ÉèÖÃÔÂ³õÊ¼²ÎÊýÎª09
    WritePCF8563(0x08,0x12); //ÉèÖÃÄê³õÊ¼²ÎÊýÎª12
    //***************************
    while(1)               //ËÀÑ­»·,µ¥Æ¬»ú³õÊ¼»¯ºó,½«Ò»Ö±ÔËÐÐÕâ¸öËÀÑ­»·
    {
        DISbuf=ReadPCF8563(0x08); //¶Á³öÄê²ÎÊý 
    
    //***1602Òº¾§ÏÔÊ¾0-0XFF***
        j=DISbuf>>4;                //°ÑÒªÏÔÊ¾ÄÚÈÝµÄ¸ß4Î»ÒÆµ½µÍ4Î»ÉÏ
		j&=0x01;
        j+='0';                 	//0-9µÄÊý¾ÝÒÔ0Îª»ùµã½øÐÐÆ«ÒÆ¼´¿É        
        LCD1602_Disp(0,0,j);        //ÔÚµÚ1ÐÐµÄµÚ3ÁÐÏÔÊ¾¸ß4Î»µÄÊ®Áù½øÖÆÊý×Ö
        j=DISbuf&0x0F;              //°ÑÒªÏÔÊ¾ÄÚÈÝµÄ¸ß4Î»ÆÁ±Îµô£¬±£ÁôµÍ4Î»
        j+='0';                 	//0-9µÄÊý¾ÝÒÔ0Îª»ùµã½øÐÐÆ«ÒÆ¼´¿É        
        LCD1602_Disp(1,0,j);        //ÔÚµÚ1ÐÐµÄµÚ4ÁÐÏÔÊ¾µÍ4Î»µÄÊ®Áù½øÖÆÊý×Ö
    //***********************
		LCD1602_Disp(2,0,'.');        //ÏÔÊ¾¡°¡£¡±
		DISbuf=ReadPCF8563(0x07); 	//¶Á³öÔÂ²ÎÊý
		//***1602Òº¾§ÏÔÊ¾0-0XFF***
        j=DISbuf>>4;                //°ÑÒªÏÔÊ¾ÄÚÈÝµÄ¸ß4Î»ÒÆµ½µÍ4Î»ÉÏ
		j&=0x01;
        j+='0';                 	//0-9µÄÊý¾ÝÒÔ0Îª»ùµã½øÐÐÆ«ÒÆ¼´¿É        
        LCD1602_Disp(3,0,j);        //ÔÚµÚ1ÐÐµÄµÚ3ÁÐÏÔÊ¾¸ß4Î»µÄÊ®Áù½øÖÆÊý×Ö
        j=DISbuf&0x0F;              //°ÑÒªÏÔÊ¾ÄÚÈÝµÄ¸ß4Î»ÆÁ±Îµô£¬±£ÁôµÍ4Î»
        j+='0';                 	//0-9µÄÊý¾ÝÒÔ0Îª»ùµã½øÐÐÆ«ÒÆ¼´¿É        
        LCD1602_Disp(4,0,j);        //ÔÚµÚ1ÐÐµÄµÚ4ÁÐÏÔÊ¾µÍ4Î»µÄÊ®Áù½øÖÆÊý×Ö
    //***********************
		LCD1602_Disp(5,0,'.');        //ÏÔÊ¾¡°¡£¡
        DISbuf=ReadPCF8563(0x05); 	//¶Á³öÈÕ²ÎÊý
		//***1602Òº¾§ÏÔÊ¾0-0XFF***
        j=DISbuf>>4;                //°ÑÒªÏÔÊ¾ÄÚÈÝµÄ¸ß4Î»ÒÆµ½µÍ4Î»ÉÏ
		j&=0x03;
        j+='0';                 	//0-9µÄÊý¾ÝÒÔ0Îª»ùµã½øÐÐÆ«ÒÆ¼´¿É       
        LCD1602_Disp(6,0,j);        //ÔÚµÚ1ÐÐµÄµÚ3ÁÐÏÔÊ¾¸ß4Î»µÄÊ®Áù½øÖÆÊý×Ö
        j=DISbuf&0x0F;              //°ÑÒªÏÔÊ¾ÄÚÈÝµÄ¸ß4Î»ÆÁ±Îµô£¬±£ÁôµÍ4Î»
        j+='0';                 	//0-9µÄÊý¾ÝÒÔ0Îª»ùµã½øÐÐÆ«ÒÆ¼´¿É        
        LCD1602_Disp(7,0,j);        //ÔÚµÚ1ÐÐµÄµÚ4ÁÐÏÔÊ¾µÍ4Î»µÄÊ®Áù½øÖÆÊý×Ö
    //***********************
        DISbuf=ReadPCF8563(0x04); 	//¶Á³öÐ¡Ê±²ÎÊý
	//***1602Òº¾§ÏÔÊ¾0-0XFF***
        j=DISbuf>>4;                //°ÑÒªÏÔÊ¾ÄÚÈÝµÄ¸ß4Î»ÒÆµ½µÍ4Î»ÉÏ
		j&=0x03;
        j+='0';                 	//0-9µÄÊý¾ÝÒÔ0Îª»ùµã½øÐÐÆ«ÒÆ¼´¿É        
        LCD1602_Disp(0,1,j);        //ÔÚµÚ1ÐÐµÄµÚ3ÁÐÏÔÊ¾¸ß4Î»µÄÊ®Áù½øÖÆÊý×Ö
        j=DISbuf&0x0F;              //°ÑÒªÏÔÊ¾ÄÚÈÝµÄ¸ß4Î»ÆÁ±Îµô£¬±£ÁôµÍ4Î»
        j+='0';                 	//0-9µÄÊý¾ÝÒÔ0Îª»ùµã½øÐÐÆ«ÒÆ¼´¿É        
        LCD1602_Disp(1,1,j);        //ÔÚµÚ1ÐÐµÄµÚ4ÁÐÏÔÊ¾µÍ4Î»µÄÊ®Áù½øÖÆÊý×Ö
    //***********************
		LCD1602_Disp(2,1,':');        //ÏÔÊ¾':'
        DISbuf=ReadPCF8563(0x03); 	//¶Á³ö·ÖÖÓ²ÎÊý
	//***1602Òº¾§ÏÔÊ¾0-0XFF***
        j=DISbuf>>4;                //°ÑÒªÏÔÊ¾ÄÚÈÝµÄ¸ß4Î»ÒÆµ½µÍ4Î»ÉÏ
		j&=0x07;
        j+='0';                 	//0-9µÄÊý¾ÝÒÔ0Îª»ùµã½øÐÐÆ«ÒÆ¼´¿É        
        LCD1602_Disp(3,1,j);        //ÔÚµÚ1ÐÐµÄµÚ3ÁÐÏÔÊ¾¸ß4Î»µÄÊ®Áù½øÖÆÊý×Ö
        j=DISbuf&0x0F;              //°ÑÒªÏÔÊ¾ÄÚÈÝµÄ¸ß4Î»ÆÁ±Îµô£¬±£ÁôµÍ4Î»
        j+='0';                 	//0-9µÄÊý¾ÝÒÔ0Îª»ùµã½øÐÐÆ«ÒÆ¼´¿É          
        LCD1602_Disp(4,1,j);        //ÔÚµÚ1ÐÐµÄµÚ4ÁÐÏÔÊ¾µÍ4Î»µÄÊ®Áù½øÖÆÊý×Ö
    //***********************
		LCD1602_Disp(5,1,':');        //ÏÔÊ¾':'
        DISbuf=ReadPCF8563(0x02); 	//¶Á³öÃë²ÎÊý
		//***1602Òº¾§ÏÔÊ¾0-0XFF***
        j=DISbuf>>4;                //°ÑÒªÏÔÊ¾ÄÚÈÝµÄ¸ß4Î»ÒÆµ½µÍ4Î»ÉÏ
		j&=0x07;
        j+='0';                     //0-9µÄÊý¾ÝÒÔ0Îª»ùµã½øÐÐÆ«ÒÆ¼´¿É        
        LCD1602_Disp(6,1,j);        //ÔÚµÚ1ÐÐµÄµÚ3ÁÐÏÔÊ¾¸ß4Î»µÄÊ®Áù½øÖÆÊý×Ö
        j=DISbuf&0x0F;              //°ÑÒªÏÔÊ¾ÄÚÈÝµÄ¸ß4Î»ÆÁ±Îµô£¬±£ÁôµÍ4Î»
        j+='0';                     //0-9µÄÊý¾ÝÒÔ0Îª»ùµã½øÐÐÆ«ÒÆ¼´¿É          
        LCD1602_Disp(7,1,j);        //ÔÚµÚ1ÐÐµÄµÚ4ÁÐÏÔÊ¾µÍ4Î»µÄÊ®Áù½øÖÆÊý×Ö
    //***********************
    }
}


