////////////////////////////////////////////////////////////////////////////
//                给力者单片机开发学习系统，开发学习都给力！              //
////////////////////////////////////////////////////////////////////////////
//                     学习51单片机，其实可以很简单                       //
////////////////////////////////////////////////////////////////////////////
//                宁波芯动电子有限公司  www.MovingChip.com                //
////////////////////////////////////////////////////////////////////////////

#include <AT89X52.h>       //调用51单片机的头文件

//---------------------------------------
//定义一个数据表格
unsigned char code TAB[8]=
{                          //定义表格一定要使用code，这样会做到程序存储区中
    0x7F,                  //表格第1步数据0b01111111
    0x3F,                  //表格第2步数据0b00111111
    0xBF,                  //表格第3步数据0b10111111
    0x9F,                  //表格第4步数据0b10011111
    0xDF,                  //表格第5步数据0b11011111
    0xCF,                  //表格第6步数据0b11001111
    0xEF,                  //表格第7步数据0b11101111
    0x6F,                  //表格第8步数据0b01101111
};

//---------------------------------------
//名称: 主函数
//适用：给力者GL9单片机开发学习系统
//公司：宁波芯动电子有限公司
//网址：www.MovingChip.com
//日期：20120914
//---------------------------------------
void main(void)            //主函数,单片机开机后就是从这个函数开始运行
{

    unsigned int a=0;      //定义一个int型变量，做延时用
    unsigned char b=15;    //定义一个char型变量，显示内容用

    while(1)               //死循环,单片机初始化后,将一直运行这个死循环
    {
        for(a=0;a<500;a++); //延时若干时间，具体时长暂不理会
        if(++b>7) b=0;     //b做加1操作，并限制在0-7以内
        P1=TAB[b];          //将TAB[b]的值送入P1口输出

    }
}

