////////////////////////////////////////////////////////////////////////////
//                给力者单片机开发学习系统，开发学习都给力！              //
////////////////////////////////////////////////////////////////////////////
//                     学习51单片机，其实可以很简单                       //
////////////////////////////////////////////////////////////////////////////
//                宁波芯动电子有限公司  www.MovingChip.com                //
////////////////////////////////////////////////////////////////////////////

#include <AT89X52.h>       //调用51单片机的头文件

//---------------------------------------
//"国"字的字形表，供显示时查询
unsigned char code han[]=
{                          //定义表格一定要使用code，这样会做到程序存储区中
/*--  文字:  国  --*/
/*--  Trebuchet MS12;  此字体下对应的点阵为：宽x高=16x16   --*/
0x00,0x7F,0x40,0x50,0x51,0x51,0x51,0x5F,0x51,0x51,0x51,0x50,0x40,0x7F,0x00,0x00,
0x00,0xFF,0x02,0x12,0x12,0x12,0x12,0xF2,0x12,0x92,0x72,0x12,0x02,0xFF,0x00,0x00,
};

//---------------------------------------
//LED点阵屏相关I/O设置
sbit U15E3=P1^3;           //LED点阵屏单元的U15(74HC138)的使能端E3脚接在P1.3口上
sbit U14E3=P1^4;           //LED点阵屏单元的U14(74HC138)的使能端E3脚接在P1.4口上
//---------------------------------------

//---------------------------------------
//LED点阵屏寄存器设置
unsigned char m=15;        //设置8位的unsigend char型寄存器用来做汉字显示的索引
unsigned char n;           //设置8位的unsigend char型寄存器用来做延时用
//---------------------------------------

//---------------------------------------
//名称: 主函数
//适用：给力者GL9单片机开发学习系统
//公司：宁波芯动电子有限公司
//网址：www.MovingChip.com
//日期：20120914
//---------------------------------------
void main(void)            //主函数,单片机开机后就是从这个函数开始运行
{

    while(1)               //死循环,单片机初始化后,将一直运行这个死循环
    {

        for(n=0;n<80;n++); //做一个0-80的循环，不执行其他操作，只为延时
        if(++m>15) m=0;    //每调用一次函数将m加1，并限制在0-15以内
        P1=0;              //将LED点阵屏的列控制信号全部清零，准备重置 
        P0=han[m];         //LED点阵屏的上半屏，按m索引查表送P0 
        P2=han[m+16];      //LED点阵屏的下半屏，按m+16索引查表送P2 
        P1|=m&0x07;        //将索引m的低3位送给P1的低3位，以使74HC138去片选 
        if(m<8) U15E3=1;   //前8列需要使能U15(74HC138) 
        else U14E3=1;      //后8列需要使能U14(74HC138) 

    }
}

