////////////////////////////////////////////////////////////////////////////
//                给力者单片机开发学习系统，开发学习都给力！              //
////////////////////////////////////////////////////////////////////////////
//                     学习51单片机，其实可以很简单                       //
////////////////////////////////////////////////////////////////////////////
//                宁波芯动电子有限公司  www.MovingChip.com                //
////////////////////////////////////////////////////////////////////////////

#include <AT89X52.h>       //调用51单片机的头文件

//---------------------------------------
//定义一个数据表格
unsigned char code TAB[10]=
{                          //定义表格一定要使用code，这样会做到程序存储区中
    0x3F,                  //表格第1步数据0b00111111
    0x06,                  //表格第2步数据0b00000110
    0x5B,                  //表格第3步数据0b01011011
    0x4F,                  //表格第4步数据0b01001111
    0x66,                  //表格第5步数据0b01100110
    0x6D,                  //表格第6步数据0b01101101
    0x7D,                  //表格第7步数据0b01111101
    0x07,                  //表格第8步数据0b00000111
    0x7F,                  //表格第9步数据0b01111111
    0x6F,                  //表格第10步数据0b01101111
};

//---------------------------------------
//8独立按键相关I/O设置
sbit P1key=P1^0;           //按键P1接在P0.0口上
sbit P2key=P1^1;           //按键P2接在P0.1口上
sbit P3key=P1^2;           //按键P3接在P0.2口上
sbit P4key=P1^3;           //按键P4接在P0.3口上
sbit P5key=P1^4;           //按键P5接在P0.4口上
sbit P6key=P1^5;           //按键P6接在P0.5口上
sbit P7key=P1^6;           //按键P7接在P0.6口上
sbit P8key=P1^7;           //按键P8接在P0.7口上
//---------------------------------------

//---------------------------------------
//按键部分用寄存器设置
unsigned char KEYbuf;      //设置8位的寄存器用来暂存按键键值数据
//---------------------------------------

//---------------------------------------
//名称: 主函数
//适用：给力者GL9单片机开发学习系统
//公司：宁波芯动电子有限公司
//网址：www.MovingChip.com
//日期：20120914
//---------------------------------------
void main(void)            //主函数,单片机开机后就是从这个函数开始运行
{

    while(1)               //死循环,单片机初始化后,将一直运行这个死循环
    {
        
    //***8独立按键扫描部分***
    //按P1-P8键，KEYbuf赋值1-8
        if(P1key==0) KEYbuf=1;     //如果P1键按下，KEYbuf赋值写1
        else if(P2key==0) KEYbuf=2; //如果P2键按下，KEYbuf赋值写2
        else if(P3key==0) KEYbuf=3; //如果P3键按下，KEYbuf赋值写3
        else if(P4key==0) KEYbuf=4; //如果P4键按下，KEYbuf赋值写4
        else if(P5key==0) KEYbuf=5; //如果P5键按下，KEYbuf赋值写5
        else if(P6key==0) KEYbuf=6; //如果P6键按下，KEYbuf赋值写6
        else if(P7key==0) KEYbuf=7; //如果P7键按下，KEYbuf赋值写7
        else if(P8key==0) KEYbuf=8; //如果P8键按下，KEYbuf赋值写8
    //*********************
		P2=TAB[KEYbuf];          	//将TAB[KEYbuf]的值送入P2口输出

    }
}


