////////////////////////////////////////////////////////////////////////////
//                给力者单片机开发学习系统，开发学习都给力！              //
////////////////////////////////////////////////////////////////////////////
//                     学习51单片机，其实可以很简单                       //
////////////////////////////////////////////////////////////////////////////
//                宁波芯动电子有限公司  www.MovingChip.com                //
////////////////////////////////////////////////////////////////////////////

#include <AT89X52.h>       //调用51单片机的头文件

sbit RE_DE=P3^2;
//---------------------------------------
//串口接收寄存器设置
unsigned char USARTbuf;    //设置8位的unsigend char型寄存器用来暂存串口接收内容
//---------------------------------------

//---------------------------------------
//名称: 主函数
//适用：给力者GL9单片机开发学习系统
//公司：宁波芯动电子有限公司
//网址：www.MovingChip.com
//日期：20120916
//---------------------------------------
void main(void)            //主函数,单片机开机后就是从这个函数开始运行
{
	unsigned int a;
	unsigned char b;
    //*****USART串口初始化*****
    TMOD&=0x0F;            //把TMOD高4位清0
    TMOD|=0x20;            //将TMOD的M1位置1，设置成自动装入的8位定时器
    TH1=0xFA;              //设置波特率为9600
    TL1=0xFA;              //设置波特率为9600
    TR1=1;                 //启动定时器T1，作为串口波特率发生器
    SCON=0x50;             //10位异步收发，波特率由定时器控制，允许串口接收
    ES=0;                  //禁止串口中断
    //**************************
	 RE_DE=1;               //使MAX485芯片的数据方向为发送方向
    while(1)               //死循环,单片机初始化后,将一直运行这个死循环
    {    
       if(++a>40000)       //做个延时，间隔发送，具体延时时间不用关注
		 {
		     a=0;
			  b++;           
           SBUF=b;         //循环发送0-255至串口
           while(!TI);     //一直等到数据发送完毕
        }    
    }
}


