////////////////////////////////////////////////////////////////////////////
//                给力者单片机开发学习系统，开发学习都给力！              //
////////////////////////////////////////////////////////////////////////////
//                     学习51单片机，其实可以很简单                       //
////////////////////////////////////////////////////////////////////////////
//                宁波芯动电子有限公司  www.MovingChip.com                //
////////////////////////////////////////////////////////////////////////////

#include <AT89X52.h>       //调用51单片机的头文件

//---------------------------------------
//8独立按键相关I/O设置
sbit P1key=P2^0;           //按键P1接在P2.0口上
sbit P2key=P2^1;           //按键P2接在P2.1口上
sbit P3key=P2^2;           //按键P3接在P2.2口上
sbit P4key=P2^3;           //按键P4接在P2.3口上
sbit P5key=P2^4;           //按键P5接在P2.4口上
sbit P6key=P2^5;           //按键P6接在P2.5口上
sbit P7key=P2^6;           //按键P7接在P2.6口上
sbit P8key=P2^7;           //按键P8接在P2.7口上
//---------------------------------------

unsigned char code tab[8][2]={ 
  0xF7,0xD2,//440HZ 1   
  0xF8,0xB7,//494HZ 2  
  0xF9,0x81,//554HZ 3  
  0xF9,0xDF,//587HZ 4    
  0xFA,0x8B,//659HZ 5     
  0xFB,0x24,//740HZ 6     
  0xFB,0xAC,//831HZ 7      
  0xFB,0xE9,//880HZ 高音1
}; 
unsigned char TH0buf;   //定义一个变量，用来装不同频率参数的高8位
unsigned char TL0buf;   //定义一个变量，用来装不同频率参数的低8位
bit S2bit;              //设置一个位变量，该位写1，蜂鸣器鸣叫，否则停止
unsigned char KEYbuf;
//---------------------------------------
//名称：定时器0中断服务程序
//适用：给力者GL9单片机开发学习系统
//公司：宁波芯动电子有限公司
//网址：www.MovingChip.com
//日期：20120914
//---------------------------------------
void Timer0(void) interrupt 1 
{                          
    TH0=TH0buf;
 	TL0=TL0buf;			  //再次置初值

    //***此处用户自行添加定时器T0中断处理程序***
	if(S2bit==1)          //如果标志位为1，启动蜂鸣器
		P1_2=!P1_2;
	else
		P1_2=1;   		  //如果标志位为0，关闭蜂鸣器
    //******************************************

}
//---------------------------------------
//名称: 主函数
//适用：给力者GL9单片机开发学习系统
//公司：宁波芯动电子有限公司
//网址：www.MovingChip.com
//日期：20120914
//---------------------------------------
void main(void)            //主函数,单片机开机后就是从这个函数开始运行
{

    //***定时器Timer0初始化***
    TMOD&=0xF0;            //将TMOD的低4位定时器0控制部分清零
    TMOD|=0x01;            //设置定时器0为方式1
    TH0=0xf8;
 	TL0=0xcd;			//暂时设置为500HZ，当有按键按下后，这个就改变了 
    TR0=1;                 //启动定时器0
    ET0=1;                 //Timer0中断允许
    //**********************

    //***开全局中断设置****
    //定时器Timer0设置了中断允许,此处要开全局中断
    EA=1;                  //开全局中断
    //*********************

    while(1)               //死循环,单片机初始化后,将一直运行这个死循环
    {
	//***8独立按键扫描部分***
    //按P1-P8键，KEYbuf赋值1-8
        if(P1key==0) KEYbuf=1;     //如果P1键按下，KEYbuf赋值写1
        else if(P2key==0) KEYbuf=2; //如果P2键按下，KEYbuf赋值写2
        else if(P3key==0) KEYbuf=3; //如果P3键按下，KEYbuf赋值写3
        else if(P4key==0) KEYbuf=4; //如果P4键按下，KEYbuf赋值写4
        else if(P5key==0) KEYbuf=5; //如果P5键按下，KEYbuf赋值写5
        else if(P6key==0) KEYbuf=6; //如果P6键按下，KEYbuf赋值写6
        else if(P7key==0) KEYbuf=7; //如果P7键按下，KEYbuf赋值写7
        else if(P8key==0) KEYbuf=8; //如果P8键按下，KEYbuf赋值写8
		  else KEYbuf=0;              //如果无键按下，KEYbuf赋值写0
    //*********************
		if(KEYbuf==1)    //如果P1键按下
		{
			S2bit=1;            //启动蜂鸣器
			TH0buf=tab[0][0];   //查表取出1音相对应的定时器参数高8位
			TL0buf=tab[0][1];   //查表取出1音相对应的定时器参数低8位
		}
		else if(KEYbuf==2)    //如果P2键按下
		{
			S2bit=1;            //启动蜂鸣器
			TH0buf=tab[1][0];   //查表取出2音相对应的定时器参数高8位
			TL0buf=tab[1][1];   //查表取出2音相对应的定时器参数低8位
		}
		else if(KEYbuf==3)    //如果P3键按下
		{
			S2bit=1;            //启动蜂鸣器
			TH0buf=tab[2][0];   //查表取出3音相对应的定时器参数高8位
			TL0buf=tab[2][1];   //查表取出3音相对应的定时器参数低8位
		}
		else if(KEYbuf==4)    //如果P4键按下
		{
			S2bit=1;            //启动蜂鸣器
			TH0buf=tab[3][0];   //查表取出4音相对应的定时器参数高8位
			TL0buf=tab[3][1];   //查表取出4音相对应的定时器参数低8位
		}
		else if(KEYbuf==5)    //如果P5键按下
		{
			S2bit=1;            //启动蜂鸣器
			TH0buf=tab[4][0];   //查表取出5音相对应的定时器参数高8位
			TL0buf=tab[4][1];   //查表取出5音相对应的定时器参数低8位
		}
		else if(KEYbuf==6)    //如果P6键按下
		{
			S2bit=1;            //启动蜂鸣器
			TH0buf=tab[5][0];   //查表取出6音相对应的定时器参数高8位
			TL0buf=tab[5][1];   //查表取出6音相对应的定时器参数低8位
		}
		else if(KEYbuf==7)    //如果P7键按下
		{
			S2bit=1;            //启动蜂鸣器
			TH0buf=tab[6][0];   //查表取出7音相对应的定时器参数高8位
			TL0buf=tab[6][1];   //查表取出7音相对应的定时器参数低8位
		}
		else if(KEYbuf==8)    //如果P8键按下
		{
			S2bit=1;            //启动蜂鸣器
			TH0buf=tab[7][0];   //查表取出高音1音相对应的定时器参数高8位
			TL0buf=tab[7][1];   //查表取出高音1音相对应的定时器参数低8位
		}
		else            //没有按键按下，停止蜂鸣器
		{
			S2bit=0;  
		}
    }
}


