////////////////////////////////////////////////////////////////////////////
//                给力者单片机开发学习系统，开发学习都给力！              //
////////////////////////////////////////////////////////////////////////////
//                     学习51单片机，其实可以很简单                       //
////////////////////////////////////////////////////////////////////////////
//                宁波芯动电子有限公司  www.MovingChip.com                //
////////////////////////////////////////////////////////////////////////////

#include <AT89X52.h>       //调用51单片机的头文件

//---------------------------------------
//定义一个数据表格
unsigned char code TAB[10]=
{                          //定义表格一定要使用code，这样会做到程序存储区中
    0x3F,                  //表格第1步数据0b00111111
    0x06,                  //表格第2步数据0b00000110
    0x5B,                  //表格第3步数据0b01011011
    0x4F,                  //表格第4步数据0b01001111
    0x66,                  //表格第5步数据0b01100110
    0x6D,                  //表格第6步数据0b01101101
    0x7D,                  //表格第7步数据0b01111101
    0x07,                  //表格第8步数据0b00000111
    0x7F,                  //表格第9步数据0b01111111
    0x6F,                  //表格第10步数据0b01101111
};
unsigned int i;      //定义一个int型变量，中断计次用
unsigned char b=9;    //定义一个char型变量，显示内容用

//---------------------------------------
//名称：定时器1中断服务程序
//适用：给力者GL9单片机开发学习系统
//公司：宁波芯动电子有限公司
//网址：www.MovingChip.com
//日期：20120914
//---------------------------------------
void Timer1(void) interrupt 3 
{                          //定时100微秒

    //***此处用户自行添加定时器T1中断处理程序***
	if(++i>9999)         //对中断计次，记到10000次后，刚好1秒钟
	{
		i=0;            //对计次用寄存器清零，以被下一个计次循环
		if(++b>9) b=0;  //进行秒计数，因为数码管为1位，所以大于9后清零
		P2=TAB[b];          //将TAB[b]的值送入P1口输出
	}
    //******************************************

}
//---------------------------------------
//名称: 主函数
//适用：给力者GL9单片机开发学习系统
//公司：宁波芯动电子有限公司
//网址：www.MovingChip.com
//日期：20120914
//---------------------------------------
void main(void)            //主函数,单片机开机后就是从这个函数开始运行
{

    //***定时器Timer1初始化***
    TMOD&=0x0F;            //将TMOD的高4位定时器1控制部分清零
    TMOD|=0x20;            //设置定时器1为方式2
    TL1=0x47;              //设置定时器1初值
    TH1=0x47;              //重装初值
    TR1=1;                 //启动定时器1
    ET1=1;                 //Timer1中断允许
    //**********************

    //***开全局中断设置****
    //定时器Timer1设置了中断允许,此处要开全局中断
    EA=1;                  //开全局中断
    //*********************

    while(1)               //死循环,单片机初始化后,将一直运行这个死循环
    {     

    }
}


