////////////////////////////////////////////////////////////////////////////
//                给力者单片机开发学习系统，开发学习都给力！              //
////////////////////////////////////////////////////////////////////////////
//                     学习51单片机，其实可以很简单                       //
////////////////////////////////////////////////////////////////////////////
//                宁波芯动电子有限公司  www.MovingChip.com                //
////////////////////////////////////////////////////////////////////////////

#include <AT89X52.h>       //调用51单片机的头文件
#include <Intrins.h>       //因本例需要使用空操作，必须调用这个头文件

//---------------------------------------
//数码管字形表，供显示时查询
unsigned char code LED[10]=
{                          //定义表格一定要使用code，这样会做到程序存储区中
    0x3F,                  //"0"的字形表，0B00111111
    0x06,                  //"1"的字形表，0B00000110
    0x5B,                  //"2"的字形表，0B01011011
    0x4F,                  //"3"的字形表，0B01001111
    0x66,                  //"4"的字形表，0B01100110
    0x6D,                  //"5"的字形表，0B01101101
    0x7D,                  //"6"的字形表，0B01111101
    0x07,                  //"7"的字形表，0B00000111
    0x7F,                  //"8"的字形表，0B01111111
    0x6F,                  //"9"的字形表，0B01101111
};

//---------------------------------------
//4位数码管相关I/O设置
sbit U16A0=P0^0;           //U16(74HC138)的A0脚接在P0.0口上
sbit U16A1=P0^1;           //U16(74HC138)的A1脚接在P0.1口上
sbit U16A2=P0^2;           //U16(74HC138)的A2脚接在P0.2口上
//---------------------------------------

//---------------------------------------
//软件模拟IIC相关I/O设置
sbit SCL=P1^1;             //PCF8563T的 SCL 引脚接于单片机的P1^1引脚上
sbit SDA=P1^0;             //PCF8563T的 SDA 引脚接于单片机的P1^0引脚上
//---------------------------------------

//---------------------------------------
//PCF8563转换用寄存器设置
unsigned char PCFbuf1;      //设置8位的寄存器用来暂存读出时钟参数
unsigned char PCFbuf2;      //设置8位的寄存器用来暂存读出时钟参数
bit Secondbit;
//---------------------------------------

//---------------------------------------
//名称：IIC启动信号函数
//适用：给力者GL9单片机开发学习系统
//公司：宁波芯动电子有限公司
//网址：www.MovingChip.com
//日期：20140219
//---------------------------------------
void IICstart(void)
{ 
     SDA=1;                //先将SDA=1，以准备在SCL=1时，将SDA=0
     SCL=1;                //时钟总线拉高 
     _nop_();              //略做延时
     _nop_();              //略做延时
     SDA=0;                //SCL=1时，将SDA拉低即产生启动信号 
     _nop_();              //略做延时
     _nop_();              //略做延时
     SCL=0;                //将SCL=0，完成启动信号操作 
} 

//---------------------------------------
//名称：IIC停止信号函数
//适用：给力者GL9单片机开发学习系统
//公司：宁波芯动电子有限公司
//网址：www.MovingChip.com
//日期：20140219
//---------------------------------------
void IICstop(void)
{ 
     SDA=0;                //先将SDA=0，以准备在SCL=1时，将SDA=1
     SCL=1;                //时钟总线拉高 
     _nop_();              //略做延时
     _nop_();              //略做延时
     SDA=1;                //SCL=1时，将SDA拉高即产生停止信号 
     _nop_();              //略做延时
     _nop_();              //略做延时
     SCL=0;                //将SCL=0，完成启动信号操作 
} 

//---------------------------------------
//名称：向IIC总线写入1个字节函数
//适用：给力者GL9单片机开发学习系统
//公司：宁波芯动电子有限公司
//网址：www.MovingChip.com
//日期：20140219
//---------------------------------------
void Write1Byte(unsigned char Buf1)
{ 
     unsigned char k;      //1个字节要分8次写入，需要定义一个寄存器用来计数
     for(k=0;k<8;k++)      //做一个8次的循环，每次写入1位，需要写8次
     {
         if(Buf1&0x80)     //从最高位开始写 
         {
             SDA=1;        //如果欲写入数据为1，就将数据线置1
         }
         else
         {
             SDA=0;        //如果欲写入数据为0，就将数据线写0 
         }
         _nop_();          //略做延时
         _nop_();          //略做延时
         SCL=1;            //时钟线做一个上升沿，将一位数据写入
         Buf1=Buf1<<1;     //数据左移一位，将下次要写入的位数据移到最高位
         _nop_();          //略做延时
         SCL=0;            //将SCL=0，以准备通过上升沿将数据写入
         _nop_();          //略做延时
     }
     SDA=1;                //将SDA=1，准备读应答信号
     _nop_();              //略做延时
     SCL=1;                //将SCL=1，做个上升沿准备读应答信号
     _nop_();              //略做延时
     _nop_();              //略做延时
     SCL=0;                //将SCL=0，结束应答信号读操作
} 

//---------------------------------------
//名称：从IIC总线读入1个字节函数
//适用：给力者GL9单片机开发学习系统
//公司：宁波芯动电子有限公司
//网址：www.MovingChip.com
//日期：20140219
//---------------------------------------
unsigned char Read1Byte(void)
{ 
     unsigned char k;      //1个字节要分8次读出，需要定义一个寄存器用来计数
     unsigned char t=0;    //定义一个寄存器用保存读出数据
     for(k=0;k<8;k++)      //做一个8次的循环，每次读入1位，需要读8次
     {
         t=t<<1;           //数据左移一位，空出最低位以准备保存读入的一位数据
         SDA=1;            //将SDA写1准备读
         SCL=1;            //将SCL=1，做个上升沿准备读一位数据
         _nop_();          //略做延时
         _nop_();          //略做延时
         if(SDA==1)        //读一位数据，并判断 
         {
             t=t|0x01;     //如果读入数据为1，就将接收缓冲区最低一位置1
         }
         else
         {
             t=t&0xfe;     //如果读入数据为0，就将接收缓冲区最低一位写0
         }
         SCL=0;            //SCL恢复为0，结束一位数据读操作
         _nop_();          //略做延时
         _nop_();          //略做延时
     }
     return t;             //将读入的一个字节返回
} 

//---------------------------------------
//名称：软件模拟IIC向PCF8563指定地址写一个字节函数
//适用：给力者GL9单片机开发学习系统
//公司：宁波芯动电子有限公司
//网址：www.MovingChip.com
//日期：20140219
//---------------------------------------
void WritePCF8563(unsigned char Address,unsigned char Databuf)
{                          //直接调用本函数即可对PCF8563的Address地址写Databuf
    IICstart();            //IIC启动信号

    Write1Byte(0xA2);      //发送PCF8563的器件地址和写信号

    Write1Byte(Address);   //发送地址

    Write1Byte(Databuf);   //发送数据

    IICstop();             //产生IIC停止信号
}

//---------------------------------------
//名称：软件模拟IIC从PCF8563指定地址读一个字节函数
//适用：给力者GL9单片机开发学习系统
//公司：宁波芯动电子有限公司
//网址：www.MovingChip.com
//日期：20140219
//---------------------------------------
unsigned ReadPCF8563(unsigned char Address)
{                          //直接调用本函数即可从PCF8563的Address地址读出数据返回
    unsigned char buf;     //定义一个寄存器用来暂存读出的数据
    IICstart();            //IIC启动信号

    Write1Byte(0xA2);      //发送PCF8563的器件地址和写信号

    Write1Byte(Address);   //发送地址

    IICstart();            //IIC启动信号

    Write1Byte(0xA3);      //发送PCF8563的器件地址和读信号

    buf=Read1Byte();//读一个字节数据

    IICstop();             //产生IIC停止信号

    return(buf);           //将读出数据返回
}

//---------------------------------------
//名称: 主函数
//适用：给力者GL9单片机开发学习系统
//公司：宁波芯动电子有限公司
//网址：www.MovingChip.com
//日期：20140219
//---------------------------------------
void main(void)            //主函数,单片机开机后就是从这个函数开始运行
{

    unsigned char c=0;     //定义一个char型变量，做延时用
    unsigned char d=0;     //定义一个char型变量，控制显示位置
	 unsigned int  e=0;
    //***初始化时钟芯片的参数为12年9月3日20点03分07秒***
    WritePCF8563(0x00,0x00); //启动PCF8563
    WritePCF8563(0x02,0x50); //设置秒初始参数为50
    WritePCF8563(0x03,0x03); //设置分钟初始参数为03
    WritePCF8563(0x04,0x20); //设置小时初始参数为20
    WritePCF8563(0x05,0x03); //设置日初始参数为03
    WritePCF8563(0x06,0x01); //设置星期初始参数为01
    WritePCF8563(0x07,0x09); //设置月初始参数为09
    WritePCF8563(0x08,0x12); //设置年初始参数为12
    //***************************
    while(1)               //死循环,单片机初始化后,将一直运行这个死循环
    {       
        for(c=0;c<250;c++); //做一个0-250的循环，不执行其他操作，只为延时
		  if(++e>600)         //延时，做闪烁的亮点
		  {
				e=0;
				Secondbit=!Secondbit;
		  }
		  PCFbuf1=ReadPCF8563(0x04); //读出小时参数        
		  PCFbuf2=ReadPCF8563(0x03); //读出分钟参数
        P2=0;              //关一次显示，以免显示出鬼影
        if(++d>3) d=0;     //先将d加1，然后判断是否大于3，大于3归零
        if(d==0)           //如果d=0,显示千位
        {
            P0=0xfb;       //U16A0=1,U16A1=1,U16A2=0选通数码管的千位进行显示
            P2=LED[(PCFbuf1>>4)&0x03];     //千位显示小时的十位
        }
        else if(d==1)      //如果d=1,显示百位
        {
            P0=0xfa;       //U16A0=0,U16A1=1,U16A2=0选通数码管的百位进行显示
            P2=LED[PCFbuf1&0x0f];     //百位显示小时的个位
				P2_7=Secondbit;           //显示闪烁的点
        }
        else if(d==2)      //如果d=2,显示十位
        {
            P0=0xf9;       //U16A0=1,U16A1=0,U16A2=0选通数码管的十位进行显示
            P2=LED[(PCFbuf2>>4)&0x07];     //十位显示分钟的十位
        }
        else               //如果d=3,显示个位
        {
            P0=0xf8;       //U16A0=0,U16A1=0,U16A2=0选通数码管的个位进行显示
            P2=LED[PCFbuf2&0x0f];     //个位显示分钟的个位
        }		
    }
}

