////////////////////////////////////////////////////////////////////////////
//                给力者单片机开发学习系统，开发学习都给力！              //
////////////////////////////////////////////////////////////////////////////
//                     学习51单片机，其实可以很简单                       //
////////////////////////////////////////////////////////////////////////////
//                宁波芯动电子有限公司  www.MovingChip.com                //
////////////////////////////////////////////////////////////////////////////

#include <AT89X52.h>       //调用51单片机的头文件

//---------------------------------------
//8独立按键相关I/O设置
sbit P1key=P1^0;           //按键P1接在P0.0口上
sbit P2key=P1^1;           //按键P2接在P0.1口上
sbit P3key=P1^2;           //按键P3接在P0.2口上
sbit P4key=P1^3;           //按键P4接在P0.3口上
sbit P5key=P1^4;           //按键P5接在P0.4口上
sbit P6key=P1^5;           //按键P6接在P0.5口上
sbit P7key=P1^6;           //按键P7接在P0.6口上
sbit P8key=P1^7;           //按键P8接在P0.7口上
//---------------------------------------

//---------------------------------------
//按键部分用寄存器设置
unsigned char KEYbuf;      //设置8位的寄存器用来暂存按键键值数据
//---------------------------------------

//---------------------------------------
//名称: 主函数
//适用：给力者GL9单片机开发学习系统
//公司：宁波芯动电子有限公司
//网址：www.MovingChip.com
//日期：20120913
//---------------------------------------
void main(void)            //主函数,单片机开机后就是从这个函数开始运行
{
   
    while(1)               //死循环,单片机初始化后,将一直运行这个死循环
    {
    	P0=~P1;             //P1的状态取反后直接送至P0
    }
}


