////////////////////////////////////////////////////////////////////////////
//                给力者单片机开发学习系统，开发学习都给力！              //
////////////////////////////////////////////////////////////////////////////
//                     学习51单片机，其实可以很简单                       //
////////////////////////////////////////////////////////////////////////////
//                宁波芯动电子有限公司  www.MovingChip.com                //
////////////////////////////////////////////////////////////////////////////

#include <AT89X52.h>       //调用51单片机的头文件

//---------------------------------------
//数码管字形表，供显示时查询
unsigned char code LED[10]=
{                          //定义表格一定要使用code，这样会做到程序存储区中
    0x3F,                  //"0"的字形表，0B00111111
    0x06,                  //"1"的字形表，0B00000110
    0x5B,                  //"2"的字形表，0B01011011
    0x4F,                  //"3"的字形表，0B01001111
    0x66,                  //"4"的字形表，0B01100110
    0x6D,                  //"5"的字形表，0B01101101
    0x7D,                  //"6"的字形表，0B01111101
    0x07,                  //"7"的字形表，0B00000111
    0x7F,                  //"8"的字形表，0B01111111
    0x6F,                  //"9"的字形表，0B01101111
};

//---------------------------------------
//4位数码管相关I/O设置
sbit U16A0=P1^0;           //U16(74HC138)的A0脚接在P1.0口上
sbit U16A1=P1^1;           //U16(74HC138)的A1脚接在P1.1口上
sbit U16A2=P1^2;           //U16(74HC138)的A2脚接在P1.2口上
//---------------------------------------

//---------------------------------------
//名称: 主函数
//适用：给力者GL9单片机开发学习系统
//公司：宁波芯动电子有限公司
//网址：www.MovingChip.com
//日期：20120914
//---------------------------------------
void main(void)            //主函数,单片机开机后就是从这个函数开始运行
{


    U16A0=0;               //U16A0=0,U16A1=0,U16A2=0,选通数码管的个位进行显示
    U16A1=0;               //U16A0=0,U16A1=0,U16A2=0,选通数码管的个位进行显示
    U16A2=0;               //U16A0=0,U16A1=0,U16A2=0,选通数码管的个位进行显示
    //****数码管显示"3"****
    P2=LED[3];             //查表取"3"的字形数据送至P2显示
    //************************

    while(1)               //死循环,单片机初始化后,将一直运行这个死循环
    {

    }
}

