////////////////////////////////////////////////////////////////////////////
//                给力者单片机开发学习系统，开发学习都给力！              //
////////////////////////////////////////////////////////////////////////////
//                     学习51单片机，其实可以很简单                       //
////////////////////////////////////////////////////////////////////////////
//                宁波芯动电子有限公司  www.MovingChip.com                //
////////////////////////////////////////////////////////////////////////////

#include <AT89X52.h>       //调用51单片机的头文件

//---------------------------------------
//8独立按键相关I/O设置
sbit P1key=P2^0;           //按键P1接在P2.0口上
sbit P2key=P2^1;           //按键P2接在P2.1口上
sbit P3key=P2^2;           //按键P3接在P2.2口上
sbit P4key=P2^3;           //按键P4接在P2.3口上
sbit P5key=P2^4;           //按键P5接在P2.4口上
sbit P6key=P2^5;           //按键P6接在P2.5口上
sbit P7key=P2^6;           //按键P7接在P2.6口上
sbit P8key=P2^7;           //按键P8接在P2.7口上
//---------------------------------------

//---------------------------------------
//按键部分用寄存器设置
unsigned char KEYbuf;      //设置8位的寄存器用来暂存按键键值数据
//---------------------------------------

//---------------------------------------
//名称: 主函数
//适用：给力者GL9单片机开发学习系统
//公司：宁波芯动电子有限公司
//网址：www.MovingChip.com
//日期：20120914
//---------------------------------------
void main(void)            //主函数,单片机开机后就是从这个函数开始运行
{
    P1_3=1;                //按位方式写P1.3=1   
    while(1)               //死循环,单片机初始化后,将一直运行这个死循环
    {
    //***8独立按键扫描部分***
    //按P1-P8键，KEYbuf赋值1-8
        if(P1key==0) KEYbuf=1;     //如果P1键按下，KEYbuf赋值写1
        else if(P2key==0) KEYbuf=2; //如果P2键按下，KEYbuf赋值写2
        else if(P3key==0) KEYbuf=3; //如果P3键按下，KEYbuf赋值写3
        else if(P4key==0) KEYbuf=4; //如果P4键按下，KEYbuf赋值写4
        else if(P5key==0) KEYbuf=5; //如果P5键按下，KEYbuf赋值写5
        else if(P6key==0) KEYbuf=6; //如果P6键按下，KEYbuf赋值写6
        else if(P7key==0) KEYbuf=7; //如果P7键按下，KEYbuf赋值写7
        else if(P8key==0) KEYbuf=8; //如果P8键按下，KEYbuf赋值写8
    //*********************
		if(KEYbuf==1)               //P1键按下后，继电器吸合
		{
			P1_3=0;
		}
		else if(KEYbuf==2)          //P2键按下后，继电器释放
		{
			P1_3=1;
		}
    }
}

