////////////////////////////////////////////////////////////////////////////
//                给力者单片机开发学习系统，开发学习都给力！              //
////////////////////////////////////////////////////////////////////////////
//                     学习51单片机，其实可以很简单                       //
////////////////////////////////////////////////////////////////////////////
//                宁波芯动电子有限公司  www.MovingChip.com                //
////////////////////////////////////////////////////////////////////////////

#include <AT89X52.h>       //调用51单片机的头文件
//---------------------------------------
//名称: 按键扫描函数
//适用：给力者GL9单片机开发学习系统
//公司：宁波芯动电子有限公司
//网址：www.MovingChip.com
//日期：20130924
//---------------------------------------
unsigned char ScanKey(void)
{
	 //***4×4矩阵按键扫描部分***
    //按K1-K16键，返回参数1-16
	 P1=0xFE;                  	//将第一行置零，以扫描K1-K4是否被按下
    if(P1_4==0) return 1;     	//如果K1键按下，返回1
    else if(P1_5==0) return 2; 	//如果K2键按下，返回2
    else if(P1_6==0) return 3; 	//如果K3键按下，返回3
    else if(P1_7==0) return 4; 	//如果K4键按下，返回4

    P1=0xFD;                  	//将第二行置零，以扫描K5-K8是否被按下
    if(P1_4==0) return 5;     	//如果K5键按下，返回5
    else if(P1_5==0) return 6; 	//如果K6键按下，返回6
    else if(P1_6==0) return 7; 	//如果K7键按下，返回7
    else if(P1_7==0) return 8; 	//如果K8键按下，返回8

    P1=0xFB;                  	//将第三行置零，以扫描K9-K12是否被按下
    if(P1_4==0) return 9;     	//如果K9键按下，返回9
    else if(P1_5==0) return 10;  //如果K10键按下，返回10
    else if(P1_6==0) return 11;  //如果K11键按下，返回11
    else if(P1_7==0) return 12;  //如果K12键按下，返回12

    P1=0xF7;                  	//将第四行置零，以扫描K13-K16是否被按下
    if(P1_4==0) return 13;     	//如果K13键按下，返回13
    else if(P1_5==0) return 14;  //如果K14键按下，返回14
    else if(P1_6==0) return 15;  //如果K15键按下，返回15
    else if(P1_7==0) return 16;  //如果K16键按下，返回16

	 return 0;                    //如果无按键按下，返回0
}
//---------------------------------------
//名称: 主函数
//适用：给力者GL9单片机开发学习系统
//公司：宁波芯动电子有限公司
//网址：www.MovingChip.com
//日期：20130924
//---------------------------------------
void main(void)            //主函数,单片机开机后就是从这个函数开始运行
{    
	unsigned char k;
	P3_3=1;                //按位方式写P1.3=1，保证继电器处于释放状态   
   while(1)               //死循环,单片机初始化后,将一直运行这个死循环
   {
		k=ScanKey();
 		if(k==1)
			P3_3=0;        //如果K1键按下，继电器吸合   
		else if(k==2)
			P3_3=1;        //如果K2键按下，继电器释放		
   }
}

